<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.override.wk.ams.slack</string>
	<key>Input</key>
	<dict>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>NAME</key>
		<string>Slack</string>
		<key>PKG_ID</key>
		<string>com.tinyspeck.slackmacgap</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://rink.hockeyapp.net/api/2/apps/38e415752d573e7e78e06be8daf5acc1</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.killahquam.pkg.slack</string>
	<key>Process</key>
	<string></string>
</dict>
</plist>
