<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of Hightail Express</string>
  <key>Identifier</key>
  <string>com.github.impvaderbeeatch.download.hightailexpress</string>

  <key>Input</key>
    <dict>
      <key>FEED_URL</key>
      <string>https://static.hightail.com/plugins/HightailExpress.dmg</string>
      <key>NAME</key>
      <string>Hightail Express</string>
    </dict>

  <key>MinimumVersion</key>
  <string>0.6.1</string>
    <!-- I made this recipe at autopkgr ver 0.6.1
         Not tested anything under  -->
         
  <key>Process</key>
  <array>
    <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>%FEED_URL%</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
