<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>This recipe will update VLC using Multi-triggers</string>
	
	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.jss.update-vlc</string>
	
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>SW: %NAME% needs update</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/sgt.install-startup.xml</string>
		<key>NAME</key>
		<string>VLC</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Installed Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/update.vlc.pt.xml</string>
	</dict>
	
	<key>ParentRecipe</key>
	<string>com.github.jss-recipes.jss.VLC</string>
</dict>
</plist>
