<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>
This AutoPkg recipe was created using JSSRecipeCreator: 
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter: 
https://github.com/sheagcraig/JSSImporter

For tips on integrating JSSImporter into your Casper environment, check out Auto Update Magic:
https://github.com/homebysix/auto-update-magic</string>
	<key>Description</key>
	<string>Downloads the current release version of 'The Unarchiver' and builds a package.

Note: this recipe has issues with repeated runs due to a bug in curl starting
with OS X 10.10.5. This has been fixed for the next version of AutoPkg, but not
yet in a released version. It should still download and unzip properly if is it is the first run, without an already-downloaded file.
 Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.jss.theunarchiver</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>DESCRIPTION</key>
		<string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X.</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/The Unarchiver.png</string>
		<key>NAME</key>
		<string>The Unarchiver</string>
		<key>POLICY_CATEGORY</key>
		<string>Install Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/pt.add.self.service.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.TheUnarchiver</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>SW: The Unarchiver Candidate</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
