<policy>
    <general>
        <!-- Enable ID or Name for a Site-based Policy
        <site>
            <id>%SITE_ID%</id>
            <name>%SITE_NAME%</name>
        </site>
        -->
        <name>PI: %PROD_NAME%</name>
        <enabled>true</enabled>
        <trigger>Startup</trigger>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <!-- If you want to offer this in Self Service as well, uncomment below -->
    <!--  <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %VERSION%</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
        </self_service>
      -->
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
