<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.jss.add-firefox</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>DESCRIPTION</key>
		<string>Web Browser</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>GROUP_NAME</key>
		<string>SW: %NAME% Candidate</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/sgt.self-service.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/Firefox.png</string>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>POLICY_CATEGORY</key>
		<string>Install Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/pt.add.self.service.xml</string>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.jss.Firefox</string>
</dict>
</plist>
