<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.pkg.teamviewerQS</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://download.teamviewer.com/download/TeamViewerQS.dmg</string>
		<key>NAME</key>
		<string>TeamViewerQS</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.justinrummel.pkg.TeamViewerQS</string>
</dict>
</plist>
