<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>

  <key>Comment</key>
	<string>This recipe will install on Startup</string>

	<key>Description</key>
	<string>Uses parent pkg recipe to downloads latest version of TeamViewer and import it into the JSS.</string>
  
	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.jss.install-teamviewer</string>
	
  <key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
    <key>DESCRIPTION</key>
		<string>TeamVier is a free VNC we use at my shopm cause it's free and our MD is a cheapskate.</string>
    <key>NAME</key>
		<string>TeamViewer</string>
    <key>POLICY_CATEGORY</key>
		<string>AMS Custom</string>
    <key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/pt.install.on.startup.xml</string>
    
		<key>SMART_GROUP</key>
		<string>LessThanMostRecent_%NAME%</string>
		<key>SELFSERVE_POLICY</key>
		<string>SelfServeLatest_%NAME%</string>
		<!--<key>ARB_GROUP_NAME</key><string>arbitrary</string>-->
	</dict>
  
  
	<key>MinimumVersion</key>
	<string>0.2.5</string>
  <key>ParentRecipe</key>
	<string>com.justinrummel.pkg.TeamViewer</string>
	
  <key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
        
<!--	  <key>smart_group</key>
				<string>%SMART_GROUP%</string>
				<key>selfserve_policy</key>
				<string>%SELFSERVE_POLICY%</string>
				<!--<key>arb_group_name</key><string>%ARB_GROUP_NAME%</string>-->
-->        
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
