<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>

  <key>Comment</key>
  <string>This recipe was created by Alan McCrossen and modified by Pat Camporeale to suit AMS office needs.</string>

	<key>Description</key>
	<string>Finds latest Microsoft AutoUpdate (MAU) installer, downloads the pkg and copies it to the JSS.</string>
	<key>Identifier</key>
  	<string>com.github.impvaderbeeatch.jss.install-mau</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
    		<key>DESCRIPTION</key>
		<string>Microsoft AutoUpdate</string>
		<key>GROUP_NAME</key>
		<string>SW: MS AutoUpdate needs update</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/sgt.install-startup.xml</string>
		<key>NAME</key>
		<string>Microsoft AutoUpdate</string>
		<key>POLICY_CATEGORY</key>
		<string>Install Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/pt.install.on.startup.xml</string>
	</dict>
  
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
  	<string>com.github.impvaderbeeatch.pkg.mau</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
				<key>purge_destination</key>
				<true/>
				<key>skip_payload</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/*.pkg/PackageInfo</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>packageinfo_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>MSOffice2016VersionChecker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
