<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>

  <key>Comment</key>
  <string>This recipe was created by Alan McCrossen and modified by Pat Camporeale to suit AMS office needs.
  This recipe will update MS Word on Logout trigger</string>

	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.jss.update-msword2016</string>

  	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
   		 <key>DESCRIPTION</key>
		<string>MS Office Word 2016</string>
    		<key>ICON</key>
		<string>%RECIPE_DIR%/Word.png</string>
		<key>GROUP_NAME</key>
		<string>SW: MS Word 2016 needs update</string>
		<key>GROUP_TEMPLATE</key>
   		 <string>%RECIPE_DIR%/sgt.install-startup.xml</string>
		<key>NAME</key>
		<string>Microsoft Word</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.12.x,10.11.x,10.10.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Installed Apps</string>
		<key>POLICY_TEMPLATE</key>
    		<string>%RECIPE_DIR%/update.msoffice.pt.xml</string>
	</dict>
  
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
<!--   	 <string>com.github.impvaderbeeatch.download.MSWord2016</string> -->
	 <string>com.github.impvaderbeeatch.download.MSWord2016-II</string>
  
	<key>Process</key>
	<array>
  
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
				<key>skip_payload</key>
				<true/>
			</dict>
      
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/*.pkg/PackageInfo</string>
			</dict>
      
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>packageinfo_path</key>
				<string>%found_filename%</string>
			</dict>
      
			<key>Processor</key>
			<string>MSOffice2016VersionChecker</string>
		</dict>
		<dict>
    
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
      
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
