<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>

	<key>Comment</key>
	<string>This recipe will update Slack using Multi-triggers</string>

	<key>Identifier</key>
	<string>com.github.impvaderbeeatch.jss.update-skype</string>
	
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>Comment</key>
		<string>Note: PlistReader without variable injection in AutoPkg requires setting "version" input key to an empty string, as below.</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.skype.com/go/getskype-macosx.dmg</string>
		<key>GROUP_NAME</key>
		<string>SW: %NAME% needs update</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/sgt.skype.xml</string>
		<key>NAME</key>
		<string>Skype</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.12.x,10.11.x,10.10.x,10.9.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Installed Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/pt.update.skype.xml</string>
		
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jss-recipes.jss.Skype</string>
</dict>
</plist>
